A1=zeros(12*8,12*8*2);
for i = 1:8
    for a = 1:12
        A1((i-1)*12+a,((i-1)*12+a))=1; %存疑 ，列向量应该是
        A1((i-1)*12+a,(i-1)*12+a+12*8)=-1;
    end
end

%B1=zeros(12*8,1);
B1_data=[0;60;0;240;300;360;390;270;330;0;100;0];
B1=-repmat(B1_data,8,1);

A21=zeros(4*8,12*8*2);   %%第一个机械臂的转动限制
for i = 1:8
    A21((i-1)*4+1,(i-1)*12+2)=1;
    A21((i-1)*4+1,(i-1)*12+1+12*8)=-1;
    A21((i-1)*4+2,(i-1)*12+3)=1;
    A21((i-1)*4+2,(i-1)*12+2+12*8)=-1;
    A21((i-1)*4+3,(i-1)*12+11)=1;
    A21((i-1)*4+3,(i-1)*12+10+12*8)=-1;
    A21((i-1)*4+4,(i-1)*12+12)=1;
    A21((i-1)*4+4,(i-1)*12+11+12*8)=-1;
end

A22=zeros(7*8,12*8*2);   %%第二个机械臂的转动限制
for i = 1:8
    for a = 3:9
        A22((i-1)*7+a-2,(i-1)*12+a+1)=1;
        A22((i-1)*7+a-2,(i-1)*12+a+12*8)=-1;
    end
end

B21=zeros(4*8,1);
B21_data=3*ones(4,1);
B21=repmat(B21_data,8,1);

B22=zeros(7*8,1);
B22_data=3*ones(7,1);
B22=repmat(B22_data,8,1);

if 0
A3=zeros(7*12,12*8*2);
for i = 1:7
    for a = 1:12
        A3((i-1)*12+a,(i-1)*12+a+12*8)=1;
        A3((i-1)*12+a,i*12+a)=-1;
    end
end

B3=-1*ones(7*12,1);
end 

A31=zeros(2*7,12*8*2);
for i=1:7
    A31(i,i*12+2)=-1;
    A31(i,(i-1)*12+2+12*8)=1;
    A31(i+7,i*12+11)=-1;
    A31(i+7,(i-1)*12+11+12*8)=1;
end
B31=-8*ones(2*7,1);

A32=zeros(6*7,12*8*2);
for i=1:7
    for a=4:9
        A32((i-1)*6+a-3,i*12+a)=-1;
        A32((i-1)*6+a-3,(i-1)*12+a+12*8)=1;
    end
end
B32=-11*ones(6*7,1);


A33=zeros(2*7,12*8*2);
for i=1:7
    A33(i,i*12+3)=-1;
    A33(i,(i-1)*12+3+12*8)=1;
    A33(i+7,i*12+11)=-1;
    A33(i+7,(i-1)*12+11+12*8)=1;
end
B33=-2*ones(2*7,1);

A5=zeros(2,12*8*2);
A5(1,6*12+3)=-1;
A5(1,10+12*8)=1;
A5(2,7*12+3)=-1;
A5(2,12+10+12*8)=1;
B5=-8*ones(2,1);

lb=zeros(12*8*2,1);

ub=zeros(12*8*2,1);
for i=1:8
    ub((i-1)*24+2:i*24+1)=2083*i;
end
ub(193)=[];


A4=zeros(8,12*8*2);
for i=1:8
    A4(i,(i-1)*12+1)=1;
end
B4=zeros(8,1);

A = [A1;A31;A32;A33;A5];
B = [B1;B31;B32;B33;B5];
Aeq = [A21;A22];
Beq = [B21;B22];
f = zeros(12*8*2,1);
f(12*8*2)=1;
[x,fval,exitflag,output,lambda] = linprog(f,A,B,Aeq,Beq,lb');
X=x(1:12*8,1);
Y=x(12*8+1:12*8*2,1);
res=[X,Y];     %表示每个工件在每个工位的进出时间。

part1=zeros(8,2);
for i=1:8
    part1(i,:)=res((i-1)*12+3,:);
end
part2=zeros(8,2);
for i=1:8
    part2(i,:)=res((i-1)*12+10,:);
end
Part=[part1,part2];   %%每行：表示同一个工件在3/10工序的进出时间，顺序依次为：进3，出3，进10，出10

%将各个时间变量按顺序排列，检验该方案是否可行：
res_all=[res
